Tekla Open API Reference for Tekla Structures 2025
EnumConverter.CanConvertFrom Method
[Missing <summary> documentation for "M:Tekla.Structures.Datatype.EnumConverter.CanConvertFrom(System.ComponentModel.ITypeDescriptorContext,System.Type)"]
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override bool CanConvertFrom(
	ITypeDescriptorContext context,
	Type sourceType
)
Public Overrides Function CanConvertFrom (
	context As ITypeDescriptorContext,
	sourceType As Type
) As Boolean
Parameters
context
Type: System.ComponentModel.ITypeDescriptorContext
[Missing <param name="context"/> documentation for "M:Tekla.Structures.Datatype.EnumConverter.CanConvertFrom(System.ComponentModel.ITypeDescriptorContext,System.Type)"]
sourceType
Type: System.Type
[Missing <param name="sourceType"/> documentation for "M:Tekla.Structures.Datatype.EnumConverter.CanConvertFrom(System.ComponentModel.ITypeDescriptorContext,System.Type)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Tekla.Structures.Datatype.EnumConverter.CanConvertFrom(System.ComponentModel.ITypeDescriptorContext,System.Type)"]
See Also
Reference
EnumConverter Class
Tekla.Structures.Datatype Namespace